In [1]:
import pandas as pd

df = pd.read_csv(r"C:\Users\dhiab\Downloads\salaries.csv")

In [2]:
missing_values_sum = df.isna().sum()
print(missing_values_sum)

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [3]:
import pycountry

def convert_country_codes(code):
        try:
            country = pycountry.countries.get(alpha_2=code).name
            return country
        except KeyError:
              return "Unknown"
           
											
df['employee_residence'] = df['employee_residence'].apply(convert_country_codes)

df['company_location'] = df['company_location'].apply(convert_country_codes)

In [4]:
mapping_dict = {
    'S': "Small",
    'M' : "Medium",
    "L" : "Large"
}

df['company_size'] = df['company_size'].map(mapping_dict)

In [5]:
experience_mapping = {
    'SE': 'Senior',
    'MI': 'Mid',
    'EN': 'Entry',
    'EX': 'Executive'
}

df['experience_level'] = df['experience_level'].map(experience_mapping)

In [6]:
df['job_title'] = df['job_title'].replace('Data Science', 'Data Scientist')

In [7]:
categories = {
    'Engineer': ['Engineer','Programmer','Developer'],
    'Analyst': ['Analyst'],
    'Head': ['Manager', 'Director', 'Lead', 'Specialist','Administrator','Coordinator'],
    'Scientist': ['Scientist', 'Science'],
    'Consultant': ['Consultant'],
    'Architect': ['Architect'],
    'Researcher': ['Researcher'],
    'Owner': ['Owner'],
    'Associate': ['Associate','Technician'],
}

def map_to_category(job_title):
    for category, keywords in categories.items():
        for keyword in keywords:
            if keyword.lower() in job_title.lower():
                return category
    return 'Other'

df['job_category'] = df['job_title'].apply(map_to_category)

category_counts = df['job_category'].value_counts()

print(category_counts)

job_category
Engineer      7070
Scientist     4888
Analyst       2951
Head           776
Architect      465
Other          260
Researcher      22
Consultant      10
Associate        9
Owner            8
Name: count, dtype: int64

In [8]:
df['remote_ratio'] = df['remote_ratio'].astype(str)

remote_ratio_mapping = {
    '100' : 'Remote',
    '50' : 'Hybrid',
    '0' : 'On-Site'
}

df['remote_ratio'] = df['remote_ratio'].map(remote_ratio_mapping)

In [9]:
ET_mapping = {
    'FT' : 'Full Time',
    'PT' : 'Part Time',
    'CT' : 'Contract',
    'FL' : 'Freelance'
}

df['employment_type'] = df['employment_type'].map(ET_mapping)

In [10]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size,job_category
0,2024,Senior,Full Time,Machine Learning Engineer,110000,EUR,122222,Netherlands,Remote,Netherlands,Small,Engineer
1,2024,Senior,Full Time,Machine Learning Engineer,70000,EUR,77777,Netherlands,Remote,Netherlands,Small,Engineer
2,2024,Senior,Full Time,Data Engineer,158200,USD,158200,United States,On-Site,United States,Medium,Engineer
3,2024,Senior,Full Time,Data Engineer,74100,USD,74100,United States,On-Site,United States,Medium,Engineer
4,2024,Senior,Full Time,Data Engineer,231400,USD,231400,United States,On-Site,United States,Medium,Engineer

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16459 entries, 0 to 16458
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           16459 non-null  int64
 1   experience_level    16459 non-null  object
 2   employment_type     16459 non-null  object
 3   job_title           16459 non-null  object
 4   salary              16459 non-null  int64
 5   salary_currency     16459 non-null  object
 6   salary_in_usd       16459 non-null  int64
 7   employee_residence  16459 non-null  object
 8   remote_ratio        16459 non-null  object
 9   company_location    16459 non-null  object
 10  company_size        16459 non-null  object
 11  job_category        16459 non-null  object
dtypes: int64(3), object(9)
memory usage: 1.5+ MB

In [12]:
df.describe()

          work_year        salary  salary_in_usd
count  16459.000000  1.645900e+04   16459.000000
mean    2023.223343  1.640275e+05  149743.697065
std        0.713266  3.416673e+05   68543.720816
min     2020.000000  1.400000e+04   15000.000000
25%     2023.000000  1.020000e+05  101570.000000
50%     2023.000000  1.422000e+05  141300.000000
75%     2024.000000  1.874150e+05  185900.000000
max     2024.000000  3.040000e+07  800000.000000

In [13]:
df.to_csv(r"C:\Users\dhiab\OneDrive\Bureau\clean_salary_data1")